export default {
  stack: "Стэк",
  devdate: "Период разработки",
  name: "Дмитрий Чернявский",
  head: {
    title: "Дмитрий Чернявский",
  },
  header: {
    home: "Обо мне",
    portfolio: "Портфолио",
    hobbies: "Хобби"
  },
  index: {
    title: 'Обо мне',
    hello: 'Привет и добро пожаловать!',
    skillsTitle: 'Мои скиллы:',
    didlist:
`Разработал веб-приложения и сайты с использованием современных фреймворков
Внедрил responsive design принципы чтобы обеспечить оптимальную производительность среди различных устройств
Сотрудничал с бэкэнд программистами с целью интеграции фронтэнд компонентов в сервер логику
Участвовал в код-ревью и предоставлял конструктивную обратную связь для улучшения кодовой базы
`,
    textBegin: `
Я Дмитрий Чернявский.
Я работаю Фронтэнд разработчиком на протяжении более 5 лет.
`,
    textEnd: `
Я очень ответственно отношусь к поставленным задачам и целям, открыт для работы в команде, открыт для общения, со мной легко сотрудничать и работать. Я всегда стремлюсь к изучению новейших технологий и с энтузиазмом отношусь к любым идеям.

В качестве хобби люблю заниматься разработкой игр, работал с Unreal Engine 5 и разрабатывал моды для движка X-Ray (C++, Lua). Вы можете посмотреть мои хобби на соответствующей странице Хобби.
`,
  },
  portfolio: {
    title: 'Мое портфолио',
    portfolio_site: {
      title: "Портфолио",
      description: "Сайт обо мне и моей работе",
      date: "Август 2023 - Сентябрь 2023"
    },
    rescript_elements: {
      title: "Rescript Elements",
      description: "Библиотека UI элементов написанная на комбинации Rescript-React",
      date: "Август 2023 - Сентябрь 2023",
    },
    dvipraz: {
      title: "ДВИПРАЗ сайт",
      description: "Сайт для Дальневосточного Института Дополнительного Профессионального Образования",
      date: "Август 2022 - Апрель 2023",
    },
    dvipraz_lk: {
      title: "ДВИПРАЗ Админ зона",
      description: "Админ-панель для Дальневосточного Института Дополнительного Профессионального Образования",
      date: "Октябрь 2022 - Май 2023",
    },
    uipdv: {
      title: "UIPDV сайт",
      description: "Сайт для компании «Управление инвестиционных программ»",
      date: "2020 - Август 2022"
    },
    lstar: {
      title: "Little Star сайт",
      description: "Интернет-магазин детской одежды Little Star",
      date: "May 2021 - December 2021"
    },
    vss: {
      title: "Вентстройснаб сайт",
      description: "Сайт для компании Вентстройснаб, специализирующейся на вентиляционных системах",
      date: "2020 - April 2021"
    },
    asiazip: {
      title: "Asiazip сайт",
      description: "Интернет-магазин запчастей AsiaZip",
      date: "2019 - 2020"
    },
  },
  hobbies: {
    title: 'Мои хобби'
  },
}