export default {
  stack: "Стэк",
  devdate: "Период разработки",
  name: "Дмитрий Чернявский",
  head: {
    title: "Дмитрий Чернявский",
  },
  header: {
    home: "Обо мне",
    portfolio: "Портфолио",
    hobbies: "Хобби"
  },
  index: {
    title: 'Обо мне',
    hello: 'Привет и добро пожаловать!',
    skillsTitle: 'Мои скиллы:',
    didlist:
`Разработал веб-приложения и сайты с использованием современных фреймворков
Внедрил responsive design принципы чтобы обеспечить оптимальную производительность среди различных устройств
Сотрудничал с бэкэнд программистами с целью интеграции фронтэнд компонентов в сервер логику
Участвовал в код-ревью и предоставлял конструктивную обратную связь для улучшения кодовой базы
`,
    textBegin: `
Я Дмитрий Чернявский.
Я работаю Фронтэнд разработчиком на протяжении более 5 лет.
`,
    textEnd: `
Я очень ответственно отношусь к поставленным задачам и целям, открыт для работы в команде, открыт для общения, со мной легко сотрудничать и работать. Я всегда стремлюсь к изучению новейших технологий и с энтузиазмом отношусь к любым идеям.

В качестве хобби люблю заниматься разработкой игр, работал с Unreal Engine 5 и разрабатывал моды для движка X-Ray (C++, Lua). Вы можете посмотреть мои хобби на соответствующей странице Хобби.
`,
  },
  portfolio: {
    title: 'Мое портфолио',
    portfolio_site: {
      title: "Портфолио",
      description: "Сайт обо мне и моей работе",
      date: "Август 2023 - Сентябрь 2023"
    },
    rescript_elements: {
      title: "Rescript Elements",
      description: "Библиотека UI элементов написанная на комбинации Rescript-React",
      date: "Август 2023 - Сентябрь 2023",
    },
    dvipraz: {
      title: "ДВИПРАЗ сайт",
      description: "Сайт для Дальневосточного Института Дополнительного Профессионального Образования",
      date: "Август 2022 - Апрель 2023",
    },
    dvipraz_lk: {
      title: "ДВИПРАЗ Админ зона",
      description: "Админ-панель для Дальневосточного Института Дополнительного Профессионального Образования",
      date: "Октябрь 2022 - Май 2023",
    },
    uipdv: {
      title: "UIPDV сайт",
      description: "Сайт для компании «Управление инвестиционных программ»",
      date: "2020 - Август 2022"
    },
    lstar: {
      title: "Little Star сайт",
      description: "Интернет-магазин детской одежды Little Star",
      date: "May 2021 - December 2021"
    },
    vss: {
      title: "Вентстройснаб сайт",
      description: "Сайт для компании Вентстройснаб, специализирующейся на вентиляционных системах",
      date: "2020 - April 2021"
    },
    asiazip: {
      title: "Asiazip сайт",
      description: "Интернет-магазин запчастей AsiaZip",
      date: "2019 - 2020"
    },
  },
  hobbies: {
    title: 'Мои хобби',
    beginning: 'В качестве любимого хобби я люблю создавать моды для S.T.A.L.K.E.R. Anomaly на базе движка XRay-Monolith и работать с Unreal Engine 5. Мне очень нравится работать на обоих движках, и это позволяет мне значительно расширить свои навыки в программировании помимо основной работы.',
    anomaly: {
      p1: 'Я фокусируюсь на разработке геймплейных модов, я люблю добавлять новые фичи в игру и переделывать существующие механики. Я создал более 60 модов для Anomaly, начиная от простых изменений качества жизни и заканчивая серьезными изменениями геймплея.',
      moddb_page: 'Страничка ModDB со всеми моими модами:',
      pba1: 'Одним из моих самых крупных проектов для Anomaly является',
      pba2: 'Perk Based Artefacts',
      pba3: 'мод. Данный проект, который содержит более 10 тыс. строк Lua кода, пересматривает всю систему артефактов, добавляя полностью скриптовые уникальные специальные способности и перки, вдохновляясь такими играми, как Fallout, Borderlands и др.',
      pba_showcase: 'Далее несколько демонстраций мода, сделанных ютуберами Anomaly.',
      wct1: 'Мой самый популярный мод для Anomaly - это',
      wct2: 'Weapon Cover Tilt',
      wct3: '. Этот мод добавляет процедурные анимации от первого лица, которые поднимают оружие вверх, когда игрок находится рядом со стеной. В настоящее время у него более',
      wct4: 'скачиваний.',
      tools1: 'Также я создаю инструменты для других моддеров, чтобы помочь им в разработке собственных проектов.',
      tools2: 'Например, я сделал редактор HUD, который позволяет изменять положение и вращение модели оружия от 1-го лица простым перетаскиванием мыши. Также он позволяет манипулировать моделями в режиме от 3-го лица на модели NPC для точного расположения оружия и предметов на модели.',
      xray: 'Я поддерживаю собственный форк движка XRay-Monolith (C++), который содержит новые возможности, добавленные в движок, а также возможности, разработанные и переданные замечательными участниками сообщества S.T.A.L.K.E.R. Anomaly. Движок компилируется с использованием Github Actions CI и Visual Studio 2022.',
    },
    ue: {
      p1: 'В октябре 2022 года со мной связалась компания NightmareFuelGames и предложила присоединиться к разработке кооперативной survival FPS-игры, вдохновленной S.T.A.L.K.E.R, DayZ, Hunt: Showdown и Escape From Tarkov.',
      goals: 'Я присоединился к NightmareFuelGames в качестве ведущего программиста. Моей целью является работа над программированием анимации с использованием плагина Advanced Locomotion System, программирование взаимодействия с предметами, такими как оружие, КПК и предметы ближнего боя, проведение код-ревью других программистов, отправка чейнж-листов и обслуживание репозитория нашего проекта в Perforce',
      finish: 'Мне очень нравится работать с Unreal Engine. Это отличный и простой в использовании движок, позволяющй создавать множество вещей с самого старта, при этом вся тяжелая работа по рендерингу уже выполнена внутри движка.'
    },
  },
}